// ============================================================
// TM University
// AR Route Settings
//
// direction:
// "forward" = 前進
// "left"    = 左轉
// "right"   = 右轉
//
// arrived:
// true = 抵達，不顯示 Goose + Arrow
// ============================================================


export const ROUTES = {


    // --------------------------------------------------------
    // Target 0
    // --------------------------------------------------------

    0: {

        location: "北醫大・定位點",

        instruction: "往左轉，進走廊",

        direction: "left",

        rotation: 0,

        arrived: false

    },


    // --------------------------------------------------------
    // Target 1
    // --------------------------------------------------------

    1: {

        location: "走廊",

        instruction: "往前直走",

        direction: "forward",

        rotation: 0,

        arrived: false

    },


    // --------------------------------------------------------
    // Target 2
    // --------------------------------------------------------

    2: {

        location: "柱子",

        instruction: "看到柱子後，往右轉",

        direction: "right",

        rotation: 0,

        arrived: false

    },


    // --------------------------------------------------------
    // Target 3
    // --------------------------------------------------------

    3: {

        location: "廣場",

        instruction: "往左轉，再直走",

        direction: "left",

        rotation: 0,

        arrived: false

    },


    // --------------------------------------------------------
    // Target 4
    // --------------------------------------------------------

    4: {

        location: "樹枝",

        instruction: "繼續往前走，抵達活動中心",

        direction: "forward",

        rotation: 0,

        arrived: false

    },


    // --------------------------------------------------------
    // Target 5
    // --------------------------------------------------------

    5: {

        location: "活動中心，門口",

        instruction: "抵達門口後，往右轉，上二樓",

        direction: "right",

        rotation: 0,

        arrived: false

    },


    // --------------------------------------------------------
    // Target 6
    // --------------------------------------------------------

    6: {

        location: "樓梯",

        instruction: "繼續往前走到二樓",

        direction: "left",

        rotation: 0,

        arrived: false

    },


    // --------------------------------------------------------
    // Target 7
    // --------------------------------------------------------

    7: {

        location: "目的地",

        instruction: "已抵達羽球場",

        direction: "arrived",

        rotation: 0,

        arrived: true

    }

};